	// Lab2.1.cpp
	// < Зозюк Влад >
	// Лабораторна робота № 2.1
	// Лінійні програми.
	// Варіант 14

	#include <iostream> // Підключаємо бібліотеку вводу та виводу
	#include <cmath> // Бібліотека з математичними функціями
	#include <Windows.h> // Для кирилиці

	using namespace std; // Юзаєм стандартний простір імен для комфортної праці

	double x; //  Для чисел з плавачою крапкою

	double y; //  Для чисел з плавачою крапкою

	double z1; // Результат обчислення 1-го виразу

	double z2; // Результат обчислення 2-го виразу

	int main() // Головна функція 
	{

		SetConsoleCP(1251); 

		SetConsoleOutputCP(1251);

		cout << "Введіть x = "; cin >> x;
		cout << "Введіть y = "; cin >> y;
    
		z1 = (pow(cos(x), 4) + pow(sin(y), 2) + 1.0/4.0 * pow(sin(2 * x), 2) - 1);

		z2 = sin(y + x) * sin(y - x);
	
		cout << "Результат 1 = " << z1 << "\nРезультат 2 = " << z2 << endl;

		return 0; // Сигнал правильно закінченої програми

	}